{
  "media": [
    {
      "type": "Book",
      "id": "dark_disciple",
      "title": "Dark Disciple",
      "release_date": "2015-08-24T19:02",
      "canon_date_sort": -20.9,
      "canon_date_begin": -20,
      "canon_date_end": -19,
      "img_poster": "img/poster/dark_disciple_poster.jpg",
      "img_cover": "img/cover/dark_disciple_cover.jpg",
      "characters": [
        "asajj_ventress",
        "quinlan_vos",
        "boba_fett"
      ],
      "synopsis_short": "The only way to bring down the dark side's most dangerous warrior may be for Jedi and Sith to join forces.",
      "synopsis_long": "The only way to bring down the dark side's most dangerous warrior may be for Jedi and Sith to join forces.\n\n In the war for control of the galaxy between the armies of the dark side and the Republic, former Jedi Master turned ruthless Sith Lord Count Dooku has grown ever more brutal in his tactics. Despite the powers of the Jedi and the military prowess of their clone army, the sheer number of fatalities is taking a terrible toll. And when Dooku orders the massacre of a flotilla of helpless refugees, the Jedi Council feels it has no choice but to take drastic action: targeting the man responsible for so many war atrocities, Count Dooku himself.\n\nBut the ever-elusive Dooku is dangerous prey for even the most skilled hunter. So the Council makes the bold decision to bring both sides of the Force's power to bear—pairing brash Jedi Knight Quinlan Vos with infamous one-time Sith acolyte Asajj Ventress. Though Jedi distrust for the cunning killer who once served at Dooku's side still runs deep, Ventress's hatred for her former master runs deeper. She's more than willing to lend her copious talents as a bounty hunter—and assassin—to Vos's quest.\n\nTogether, Ventress and Vos are the best hope for eliminating Dooku—as long as the emerging feelings between them don't compromise their mission. But Ventress is determined to have her retribution and at last let go of her dark Sith past. Balancing the complicated emotions she feels for Vos with the fury of her warrior's spirit, she resolves to claim victory on all fronts—a vow that will be mercilessly tested by her deadly enemy . . . and her own doubt.",
      "author": "Christie Golden"
    },
    {
      "type": "Movie",
      "id": "the_empire_strikes_back",
      "title": "Episode V - The Empire Strikes Back",
      "release_date": "1980-05-21T19:02",
      "canon_date_sort": 3,
      "canon_date_begin": 3,
      "img_poster": "img/poster/the_empire_strikes_back_poster.jpg",
      "img_cover": "img/cover/the_empire_strikes_back_cover.jpg",
      "characters": [
        "luke_skywalker",
        "leia_organa",
        "han_solo",
        "darth_vader",
        "lando_calrissian",
        "yoda",
        "chewbacca",
        "r2_d2",
        "c_3po",
        "obi_wan_kenobi"
      ],
      "synopsis_short": "After the rebels have been brutally overpowered by the Empire on their newly established base, Luke Skywalker takes advanced Jedi training with Master Yoda, while his friends are pursued by Darth Vader as part of his plan to capture Luke.",
      "synopsis_long": "It is a dark time for the Rebellion. Although the Death Star has been destroyed, Imperial troops have driven the Rebel forces from their hidden base and pursued them across the galaxy.\n\nEvading the dreaded Imperial Starfleet, a group of freedom fighters led by Luke Skywalker has established a new secret base on the remote ice world of Hoth.\n\nThe evil lord Darth Vader, obsessed with finding young Skywalker, has dispatched thousands of remote probes into the far reaches of space....",
      "director": "Irvin Kershner",
      "writers": [
        "George Lucas",
        "Lawrence Kasdan",
        "Leigh Brackett"
      ],
      "music_by": "John Williams"
    },
    {
      "type": "Movie",
      "id": "the_force_awakens",
      "title": "Episode VII - The Force Awakens",
      "release_date": "2015-12-18T19:02",
      "canon_date_sort": 34.9,
      "canon_date_begin": 34,
      "img_poster": "img/poster/the_force_awakens_poster.jpg",
      "img_cover": "img/cover/the_force_awakens_cover.jpg",
      "characters": [
        "rey",
        "finn",
        "kylo_ren",
        "poe_dameron",
        "hux",
        "phasma",
        "snoke",
        "han_solo",
        "luke_skywalker",
        "leia_organa",
        "chewbacca",
        "r2_d2",
        "c_3po"
      ],
      "synopsis_short": "A continuation of the saga created by George Lucas set thirty years after Star Wars: Episode VI - Return of the Jedi",
      "synopsis_long": "A continuation of the saga created by George Lucas set thirty years after Star Wars: Episode VI - Return of the Jedi",
      "director": "J.J. Abrams",
      "writers": [
        "J.J. Abrams",
        "Lawrence Kasdan"
      ],
      "music_by": "John Williams"
    },
    {
      "type": "Movie",
      "id": "episode_viii",
      "title": "Episode VIII",
      "release_date": "2017-05-26T19:02",
      "canon_date_sort": 36,
      "canon_date_begin": 36,
      "img_poster": "img/poster/episode_viii_poster.jpg",
      "img_cover": "img/cover/space_cover.jpg",
      "synopsis_short": "Episode VIII.",
      "synopsis_long": "Star Wars - Episode VIII",
      "director": "Rian Johnson",
      "writers": [
        "Rian Johnson"
      ],
      "music_by": "John Williams"
    },
    {
      "type": "Movie",
      "id": "episode_ix",
      "title": "Episode IX",
      "release_date": "2019-12-31T19:02",
      "canon_date_sort": 38,
      "canon_date_begin": 38,
      "img_poster": "img/poster/episode_ix_poster.jpg",
      "img_cover": "img/cover/space_cover.jpg",
      "synopsis_short": "Episode IX.",
      "synopsis_long": "Star Wars - Episode IX",
      "director": "Colin Trevorrow",
      "writers": [
        "Rian Johnson"
      ],
      "music_by": "John Williams"
    },
    {
      "type": "Comic",
      "id": "shattered_empire",
      "title": "Shattered Empire",
      "release_date": "2015-09-09T19:02",
      "canon_date_sort": 4.3,
      "canon_date_begin": 4,
      "img_poster": "img/poster/shattered_empire_poster.jpg",
      "img_cover": "img/cover/shattered_empire_cover.jpg",
      "characters": [
        "shara_bey",
        "kes_dameron",
        "han_solo",
        "luke_skywalker",
        "leia_organa",
        "r2_d2",
        "c_3po"
      ],
      "synopsis_short": "The heroes of the Rebel Alliance will soon discover that a wounded and fractious Empire may be more dangerous than any threat they faced before!",
      "synopsis_long": "Emperor Palpatine's twenty-year reign of terror came to an abrupt and fiery end in the skies above the forest moon of Endor. A decisive victory for the Rebel Alliance, to be sure, but even with the loss of its leadership, the Empire's Moffs and regional governors retained their hold on important systems from the Core to the Outer Rim, thanks to the might of the Imperial Starfleet. Now, with a power vacuum atop the Empire, those Moffs will jockey for position and control, and the heroes of the Rebel Alliance will soon discover that a wounded and fractious Empire may be more dangerous than any threat they faced before!",
      "writers": [
        "Greg Rucka"
      ]
    },
    {
      "type": "TV",
      "id": "rebels",
      "title": "Rebels",
      "release_date": "2014-09-26T19:02",
      "canon_date_sort": -5,
      "canon_date_begin": -5,
      "canon_date_end": -2,
      "img_poster": "img/poster/rebels_poster.jpg",
      "img_cover": "img/cover/rebels_cover.jpg",
      "characters": [
        "ezra_bridger",
        "kanan_jarrus",
        "hera_syndulla",
        "sabine_wren",
        "garazeb_orrelios",
        "kallus"
      ],
      "synopsis_short": "A brave and clever ragtag starship crew stands up against the evil Empire as it tightens its grip on the galaxy and hunts down the last of the Jedi Knights.",
      "synopsis_long": "The series follows a motley group of rebels who live aboard the starship Ghost as they fight against the evil Galactic Empire. The rebels include Ezra Bridger, a young orphan from Lothal who learns he can use the Force; Kanan Jarrus, a Jedi who survived Order 66; Hera Syndulla, a Twi'lek pilot and veteran resistance fighter; Sabine Wren, a Mandalorian explosives expert; Garazeb 'Zeb' Orrelios, a Lasat warrior; and the cantankerous astromech droid C1-10P, also known as Chopper. The crew will eventually help give rise to the Rebel Alliance.",
      "creators": [
        "Simon Kinberg",
        "Carrie Beck",
        "Dave Filoni"
      ]
    },
    {
      "type": "Movie",
      "id": "the_phantom_menace",
      "title": "Episode I - The Phantom Menace",
      "release_date": "1999-05-19T19:02",
      "canon_date_sort": -32,
      "canon_date_begin": -32,
      "img_poster": "img/poster/the_phantom_menace_poster.jpg",
      "img_cover": "img/cover/the_phantom_menace_cover.jpg",
      "characters": [
        "qui_gon_jinn",
        "obi_wan_kenobi",
        "padme_amidala",
        "darth_maul",
        "r2_d2",
        "yoda",
        "c_3po",
        "darth_vader"
      ],
      "synopsis_short": "Two Jedi Knights escape a hostile blockade to find allies and come across a young boy who may bring balance to the Force, but the long dormant Sith resurface to reclaim their old glory.",
      "synopsis_long": "The evil Trade Federation, led by Nute Gunray is planning to take over the peaceful world of Naboo. Jedi Knights Qui-Gon Jinn and Obi-Wan Kenobi are sent to confront the leaders. But not everything goes to plan. The two Jedi escape, and along with their new Gungan friend, Jar Jar Binks head to Naboo to warn Queen Amidala, but droids have already started to capture Naboo and the Queen is not safe there. \n\nEventually, they land on Tatooine, where they become friends with a young boy known as Anakin Skywalker. Qui-Gon is curious about the boy, and sees a bright future for him. The group must now find a way of getting to Coruscant and to finally solve this trade dispute, but there is someone else hiding in the shadows. Are the Sith really extinct? Is the Queen really who she says she is? And what's so special about this young boy?",
      "director": "George Lucas",
      "writers": [
        "George Lucas"
      ],
      "music_by": "John Williams"
    },
    {
      "type": "TV",
      "id": "the_clone_wars",
      "title": "The Clone Wars",
      "release_date": "2008-08-15T19:02",
      "canon_date_sort": -22.8,
      "canon_date_begin": -22,
      "canon_date_end": -20,
      "img_poster": "img/poster/the_clone_wars_poster.jpg",
      "img_cover": "img/cover/the_clone_wars_cover.jpg",
      "characters": [
        "ahsoka_tano",
        "obi_wan_kenobi",
        "darth_vader",
        "count_dooku",
        "mace_windu",
        "yoda"
      ],
      "synopsis_short": "The Grand Army of the Republic, led by Yoda, Mace Windu, Obi-Wan Kenobi, Anakin Skywalker and other Jedi Knights, fights the New Droid Army of the Separatists.",
      "synopsis_long": "As the Clone Wars sweep through the galaxy, the heroic Jedi Knights struggle to maintain order and restore peace. More and more systems are falling prey to the forces of the dark side as the Galactic Republic slips further and further under the sway of the Separatists and their never-ending droid army.",
      "creators": [
        "George Lucas"
      ]
    },
    {
      "type": "Movie",
      "id": "attack_of_the_clones",
      "title": "Episode II - Attack of the Clones",
      "release_date": "2002-05-16T19:02",
      "canon_date_sort": -22.9,
      "canon_date_begin": -22,
      "img_poster": "img/poster/attack_of_the_clones_poster.jpg",
      "img_cover": "img/cover/attack_of_the_clones_cover.jpg",
      "characters": [
        "obi_wan_kenobi",
        "darth_vader",
        "padme_amidala",
        "count_dooku",
        "jango_fett",
        "mace_windu",
        "yoda"
      ],
      "synopsis_short": "Ten years after initially meeting, Anakin Skywalker shares a forbidden romance with Padmé, while Obi-Wan investigates an assassination attempt on the Senator and discovers a secret clone army crafted for the Jedi.",
      "synopsis_long": "Ten years after the 'Phantom Menace' threatened the planet Naboo, Padmé Amidala is now a Senator representing her homeworld. A faction of political separatists, led by Count Dooku, attempts to assassinate her. \n\nThere are not enough Jedi to defend the Republic against the threat, so Chancellor Palpatine enlists the aid of Jango Fett, who promises that his army of clones will handle the situation. Meanwhile, Obi-Wan Kenobi continues to train the young Jedi Anakin Skywalker, who fears that the Jedi code will forbid his growing romance with Amidala.",
      "director": "George Lucas",
      "writers": [
        "George Lucas",
        "Jonathan Hales"
      ],
      "music_by": "John Williams"
    },
    {
      "type": "Book",
      "id": "a_new_dawn",
      "title": "A New Dawn",
      "release_date": "2014-09-02T19:02",
      "canon_date_sort": -11.9,
      "canon_date_begin": -11,
      "img_poster": "img/poster/a_new_dawn_poster.jpg",
      "img_cover": "img/cover/a_new_dawn_cover.jpg",
      "characters": [
        "kanan_jarrus",
        "hera_syndulla",
        "rae_sloane"
      ],
      "synopsis_short": "The brutal death of a friend at the Empire's hands forces an ex-Jedi to make a choice: bow down to fear, or stand up and fight.",
      "synopsis_long": "Ever since the Jedi were marked for death and forced to flee Coruscant, Kanan Jarrus has devoted himself to staying alive rather than serving the Force. Wandering the galaxy alone, from one anonymous job to another, he avoids trouble--especially with the Empire--at all costs. So when he discovers a deadly conflict brewing between ruthless Imperial forces and desperate revolutionaries, he's not about to get caught in the crossfire. Then the brutal death of a friend at the Empire's hands forces the ex-Jedi to make a choice: bow down to fear, or stand up and fight. \n\nBut Jarrus won't be fighting alone. Unlikely allies, including a bomb-throwing radical, a former Imperial surveillance agent, a vengeful security officer, and the mysterious Hera Syndulla--an agent provocateur with motives of her own--team up with Jarrus to challenge the Empire. As a crisis of apocalyptic proportions unfolds on the planet Gorse, they must stand together against one of the Emperor's most fearsome enforcers--for the sake of a world and its people",
      "author": "John Jackson Miller"
    },
    {
      "type": "Book",
      "id": "lost_stars",
      "title": "Lost Stars",
      "release_date": "2015-09-04T19:02",
      "canon_date_sort": -11.1,
      "canon_date_begin": -11,
      "canon_date_end": 5,
      "img_poster": "img/poster/lost_stars_poster.jpg",
      "img_cover": "img/cover/lost_stars_cover.jpg",
      "characters": [
        "thane_kyrell",
        "ciena_ree"
      ],
      "synopsis_short": "Star Wars meets Romeo and Juliet in this epic novel that follows two best friends who find themselves on opposite sides of the war between the Empire and the Rebellion.",
      "synopsis_long": "Star Wars meets Romeo and Juliet in this epic YA novel that follows two best friends who find themselves on opposite sides of the war between the Empire and the Rebellion.\n\nThis thrilling YA novel gives readers a macro view of some of the most important events in the Star Wars universe: from the purge of the Jedi in Episode III, to the beginnings of the rebellion in Star Wars Rebels, and through the fall of the Empire in Episodes IV-VI. Readers will experience these major moments through the eyes of two best friends who grow up in these troubling times, and find themselves on opposite sides of the war.",
      "author": "Claudia Gray"
    },
    {
      "type": "Book",
      "id": "lords_of_the_sith",
      "title": "Lords of the Sith",
      "release_date": "2015-04-28T19:02",
      "canon_date_sort": -14.9,
      "canon_date_begin": -14,
      "img_poster": "img/poster/lords_of_the_sith_poster.jpg",
      "img_cover": "img/cover/lords_of_the_sith_cover.jpg",
      "characters": [
        "darth_vader",
        "palpatine",
        "cham_syndulla"
      ],
      "synopsis_short": "When the Emperor and his notorious apprentice, Darth Vader, find themselves stranded in the middle of insurgent action on an inhospitable planet, they must rely on each other, the Force, and their own ruthlessness to prevail.",
      "synopsis_long": "Anakin Skywalker, Jedi Knight, is just a memory. Darth Vader, newly anointed Sith Lord, is ascendant. The Emperor’s chosen apprentice has swiftly proven his loyalty to the dark side. Still, the history of the Sith Order is one of duplicity, betrayal, and acolytes violently usurping their Masters—and the truest measure of Vader’s allegiance has yet to be taken. Until now.\n\nOn Ryloth, a planet crucial to the growing Empire as a source of slave labor and the narcotic known as “spice,” an aggressive resistance movement has arisen, led by Cham Syndulla, an idealistic freedom fighter, and Isval, a vengeful former slave. But Emperor Palpatine means to control the embattled world and its precious resources—by political power or firepower—and he will be neither intimidated nor denied. Accompanied by his merciless disciple, Darth Vader, he sets out on a rare personal mission to ensure his will is done.",
      "author": "Paul S. Kemp"
    },
    {
      "type": "Book",
      "id": "tarkin_book",
      "title": "Tarkin",
      "release_date": "2014-11-04T19:02",
      "canon_date_sort": -14.8,
      "canon_date_begin": -14,
      "img_poster": "img/poster/tarkin_book_poster.jpg",
      "img_cover": "img/cover/tarkin_book_cover.jpg",
      "characters": [
        "tarkin",
        "darth_vader",
        "palpatine"
      ],
      "synopsis_short": "Governor Wilhuff Tarkin rises through the Imperial ranks, enforcing his authority ever more mercilessly . . . and zealously pursuing his destiny as the architect of absolute dominion.",
      "synopsis_long": "He’s the scion of an honorable and revered family. A dedicated soldier and distinguished legislator. Loyal proponent of the Republic and trusted ally of the Jedi Order. Groomed by the ruthless politician and Sith Lord who would be Emperor, Governor Wilhuff Tarkin rises through the Imperial ranks, enforcing his authority ever more mercilessly . . . and zealously pursuing his destiny as the architect of absolute dominion. \n\nEscalating guerrilla attacks by resistance forces and newfound evidence of a growing Separatist conspiracy are an immediate danger the Empire must meet with swift and brutal action. And to bring down a band of elusive freedom fighters, the Emperor turns to his most formidable agents: Darth Vader, the fearsome new Sith enforcer as remorseless as he is mysterious; and Tarkin—whose tactical cunning and cold-blooded efficiency will pave the way for the Empire’s supremacy . . . and its enemies’ extinction.",
      "author": "James Luceno"
    },
    {
      "type": "Movie",
      "id": "a_new_hope",
      "title": "Episode IV - A New Hope",
      "release_date": "1977-05-25T19:02",
      "canon_date_sort": 0,
      "canon_date_begin": 0,
      "img_poster": "img/poster/a_new_hope_poster.jpg",
      "img_cover": "img/cover/a_new_hope_cover.jpg",
      "characters": [
        "luke_skywalker",
        "leia_organa",
        "han_solo",
        "obi_wan_kenobi",
        "darth_vader",
        "tarkin",
        "r2_d2",
        "c_3po"
      ],
      "synopsis_short": "Luke Skywalker joins forces with a Jedi Knight, a cocky pilot, a wookiee and two droids to save the universe from the Empire's world-destroying battle-station, while also attempting to rescue Princess Leia from the evil Darth Vader.",
      "synopsis_long": "It is a period of civil war. Rebel spaceships, striking from a hidden base, have won their first victory against the evil Galactic Empire.\n\nDuring the battle, Rebel spies managed to steal secret plans to the Empire's ultimate weapon, the DEATH STAR, an  armored space station with enough power to destroy an entire planet.\n\nPursued by the Empire's sinister agents, Princess Leia races home aboard her starship, custodian of the stolen plans that can save her people and restore freedom to the galaxy....",
      "director": "George Lucas",
      "writers": [
        "George Lucas"
      ],
      "music_by": "John Williams"
    },
    {
      "type": "Comic",
      "id": "princess_leia_comic",
      "title": "Princess Leia",
      "release_date": "2015-03-04T19:02",
      "canon_date_sort": 0.1,
      "canon_date_begin": 0,
      "img_poster": "img/poster/princess_leia_comic_poster.jpg",
      "img_cover": "img/cover/princess_leia_comic_cover.jpg",
      "characters": [
        "leia_organa",
        "r2_d2",
        "evaan_verlaine",
        "nien_nunb"
      ],
      "synopsis_short": "The rebel Princess leads her people against the Empire! The conclusion to Leia's most personal mission!",
      "synopsis_long": "Having proven themselves a formidable enemy to the Empire, the rebels are in more danger now than ever, leaving them with little time to celebrate their triumph, or lament their loss....",
      "writers": [
        "Mark Waid"
      ]
    },
    {
      "type": "Book",
      "id": "heir_to_the_jedi",
      "title": "Heir to the Jedi",
      "release_date": "2015-03-03T19:02",
      "canon_date_sort": 0.4,
      "canon_date_begin": 0,
      "img_poster": "img/poster/heir_to_the_jedi_poster.jpg",
      "img_cover": "img/cover/heir_to_the_jedi_cover.jpg",
      "characters": [
        "luke_skywalker",
        "nakari_kelen",
        "r2_d2"
      ],
      "synopsis_short": "He defeated the Empire's ultimate weapon and gave the Rebel Alliance new hope. But Luke Skywalker's battles—and the galaxy's fight for freedom—have only just begun.",
      "synopsis_long": "Luke Skywalker’s game-changing destruction of the Death Star has made him not only a hero of the Rebel Alliance but a valuable asset in the ongoing battle against the Empire. Though he’s a long way from mastering the power of the Force, there’s no denying his phenomenal skills as a pilot—and in the eyes of Rebel leaders Princess Leia Organa and Admiral Ackbar, there’s no one better qualified to carry out a daring rescue mission crucial to the Alliance cause.\n\nA brilliant alien cryptographer renowned for her ability to breach even the most advanced communications systems is being detained by Imperial agents determined to exploit her exceptional talents for the Empire’s purposes. But the prospective spy’s sympathies lie with the Rebels, and she’s willing to join their effort in exchange for being reunited with her family.\n\n It’s an opportunity to gain a critical edge against the Empire that’s too precious to pass up. It’s also a job that demands the element of surprise. So Luke and the ever-resourceful droid R2-D2 swap their trusty X-wing fighter for a sleek space yacht piloted by brash recruit Nakari Kelen, daughter of a biotech mogul, who’s got a score of her own to settle with the Empire.",
      "author": "Kevin Hearne"
    },
    {
      "type": "Book",
      "id": "twilight_company",
      "title": "Battlefront: Twilight Company",
      "release_date": "2015-11-03T19:02",
      "canon_date_sort": 1.1,
      "canon_date_begin": 1,
      "img_poster": "img/poster/twilight_company_poster.jpg",
      "img_cover": "img/cover/twilight_company_cover.jpg",
      "synopsis_short": "The bravest soldiers. The toughest warriors. The ultimate survivors.",
      "synopsis_long": "The bravest soldiers. The toughest warriors. The ultimate survivors.\n\nAmong the stars and across the vast expanses of space, the Galactic Civil War rages. On the battlefields of multiple worlds in the Mid Rim, legions of ruthless stormtroopers—bent on crushing resistance to the Empire wherever it arises—are waging close and brutal combat against an armada of freedom fighters.\n\nIn the streets and alleys of ravaged cities, the front-line forces of the Rebel Alliance are taking the fight to the enemy, pushing deeper into Imperial territory and grappling with the savage flesh-and-blood realities of war on the ground.",
      "author": "Alexander Freed"
    },
    {
      "type": "Movie",
      "id": "return_of_the_jedi",
      "title": "Episode VI - Return of the Jedi",
      "release_date": "1983-05-25T19:02",
      "canon_date_sort": 4.2,
      "canon_date_begin": 4,
      "img_poster": "img/poster/return_of_the_jedi_poster.jpg",
      "img_cover": "img/cover/return_of_the_jedi_cover.jpg",
      "characters": [
        "luke_skywalker",
        "leia_organa",
        "han_solo",
        "darth_vader",
        "lando_calrissian",
        "palpatine",
        "chewbacca",
        "yoda",
        "r2_d2",
        "c_3po",
        "obi_wan_kenobi"
      ],
      "synopsis_short": "After rescuing Han Solo from the palace of Jabba the Hutt, the rebels attempt to destroy the second Death Star, while Luke struggles to make Vader return from the dark side of the Force.",
      "synopsis_long": "Luke Skywalker has returned to his home planet of Tatooine in an attempt to rescue his friend Han Solo from the clutches of the vile gangster Jabba the Hutt.\n\n Little does Luke know that the GALACTIC EMPIRE has secretly begun construction on a new armored space station even more powerful than the first dreaded Death Star.\n\nWhen completed, this ultimate weapon will spell certain doom for the small band of rebels struggling to restore freedom to the galaxy...",
      "director": "Richard Marquand",
      "writers": [
        "George Lucas",
        "Lawrence Kasdan"
      ],
      "music_by": "John Williams"
    },
    {
      "type": "Book",
      "id": "aftermath",
      "title": "Aftermath",
      "release_date": "2015-09-04T19:02",
      "canon_date_sort": 4.4,
      "canon_date_begin": 4,
      "img_poster": "img/poster/aftermath_poster.jpg",
      "img_cover": "img/cover/aftermath_cover.jpg",
      "characters": [
        "wedge_antilles",
        "norra_wexley",
        "rae_sloane",
        "ackbar"
      ],
      "synopsis_short": "The second Death Star is destroyed. The Emperor and his powerful enforcer, Darth Vader, are rumored to be dead. The Galactic Empire is in chaos.",
      "synopsis_long": "As the Empire reels from its critical defeats at the Battle of Endor, the Rebel Alliance—now a fledgling New Republic—presses its advantage by hunting down the enemy's scattered forces before they can regroup and retaliate. But above the remote planet Akiva, an ominous show of the enemy's strength is unfolding. Out on a lone reconnaissance mission, pilot Wedge Antilles watches Imperial Star Destroyers gather like birds of prey circling for a kill, but is taken captive before he can report back to the New Republic leaders.\n\nMeanwhile, on the planet's surface, former Rebel fighter Norra Wexley has returned to her native world—war weary, ready to reunite with her estranged son, and eager to build a new life in some distant place. But when Norra intercepts Wedge Antilles's urgent distress call, she realizes her time as a freedom fighter is not yet over. What she doesn't know is just how close the enemy is—or how decisive and dangerous her new mission will be.",
      "author": "Chuck Wendig"
    },
    {
      "type": "Comic",
      "id": "kanan_comic",
      "title": "Kanan: The Last Padawan",
      "release_date": "2015-04-01T19:02",
      "canon_date_sort": -19.8,
      "canon_date_begin": -19,
      "img_poster": "img/poster/kanan_comic_poster.jpg",
      "img_cover": "img/cover/kanan_comic_cover.jpg",
      "characters": [
        "kanan_jarrus",
        "depa_billaba"
      ],
      "synopsis_short": "Kanan Jarrus — in STAR WARS REBELS, he's a cocky, sarcastic renegade fighting against the Galactic Empire alongside the rag-tag crew of the Ghost - but years before...",
      "synopsis_long": "Kanan Jarrus — in STAR WARS REBELS, he's a cocky, sarcastic renegade fighting against the Galactic Empire alongside the rag-tag crew of the Ghost... but years before, at the height of the Clone Wars, he was known as Caleb Dume, Jedi Padawan under the instruction of Jedi Master Depa Billaba. \n\nNeither master nor apprentice ever suspected that the Clone Troopers they commanded would turn on them upon the issuing of Order 66—the order to execute all Jedi. How did Caleb Dume survive? How did he learn to survive on his own? And how did he become the man we know as Kanan Jarrus? ",
      "writers": [
        "Greg Weisman"
      ]
    },
    {
      "type": "Movie",
      "id": "revenge_of_the_sith",
      "title": "Episode III - Revenge of the Sith",
      "release_date": "2005-05-19T19:02",
      "canon_date_sort": -19.9,
      "canon_date_begin": -19,
      "img_poster": "img/poster/revenge_of_the_sith_poster.jpg",
      "img_cover": "img/cover/revenge_of_the_sith_cover.jpg",
      "characters": [
        "obi_wan_kenobi",
        "darth_vader",
        "padme_amidala",
        "palpatine",
        "grievous",
        "mace_windu",
        "yoda"
      ],
      "synopsis_short": "As the Clone Wars near an end, the Sith Lord Darth Sidious steps out of the shadows, at which time Anakin succumbs to his emotions, becoming Darth Vader and putting his relationships with Obi-Wan and Padme at risk.",
      "synopsis_long": "Three years after the onset of the Clone Wars; the noble Jedi Knights are spread out across the galaxy leading a massive clone army in the war against the Separatists. After Chancellor Palpatine is kidnapped, Jedi Master Obi-Wan Kenobi and his former Padawan, Anakin Skywalker, are dispatched to eliminate the evil General Grievous.\n\n Meanwhile, Anakin's friendship with the Chancellor arouses suspicion in the Jedi Order, and dangerous to the Jedi Knight himself. When the sinister Sith Lord, Darth Sidious, unveils a plot to take over the galaxy, the fate of Anakin, the Jedi order, and the entire galaxy is at stake.",
      "director": "George Lucas",
      "writers": [
        "George Lucas"
      ],
      "music_by": "John Williams"
    },
    {
      "type": "Comic",
      "id": "son_of_dathomir",
      "title": "Darth Maul: Son of Dathomir",
      "release_date": "2014-05-21T19:02",
      "canon_date_sort": -20.1,
      "canon_date_begin": -20,
      "img_poster": "img/poster/son_of_dathomir_poster.jpg",
      "img_cover": "img/cover/son_of_dathomir_cover.jpg",
      "characters": [
        "darth_maul",
        "palpatine",
        "grievous"
      ],
      "synopsis_short": "Getting cut in half by Obi-Wan Kenobi and being rejected by his former Sith master Darth Sidious isn’t going to defeat Darth Maul. In fact, it only makes him mad enough to take on the galaxy — with an army of Mandalorians!",
      "synopsis_long": "In the aftermath of Darth Maul's takeover on Mandalore, Maul is captured by Darth Sidious, his former Sith master. Sidious imprisons Maul in the Spire, a fortress controlled by the Confederacy of Independent Systems on Stygeon Prime. Sidious is followed by two Death Watch warriors, Rook Kast and Gar Saxon, who have orders from Mandalorian Prime Minister Almec to set Maul free. Once freed, Maul and the warriors are to rendezvous with Death Watch forces on Zanbar.",
      "writers": [
        "Jeremy Barlow"
      ]
    },
    {
      "type": "Comic",
      "id": "lando_comic",
      "title": "Lando",
      "release_date": "2015-06-08T19:02",
      "canon_date_sort": 1.2,
      "canon_date_begin": 1,
      "img_poster": "img/poster/lando_comic_poster.jpg",
      "img_cover": "img/cover/lando_comic_cover.jpg",
      "characters": [
        "lando_calrissian",
        "lobot"
      ],
      "synopsis_short": "You know him...you love him...now, join him for his biggest caper as master of charm Lando Calrissian gets his very own book!",
      "synopsis_long": "It is a period of scarce opportunity. In a galaxy overrun by an oppressive and evil Galactic Empire, there is little hope for a future free from the Emperor's iron rule.\n\nBut with the Imperials distracted by a growing alliance of rebels, smugglers and pirates travel the galaxy for fortunes found only by those daring enough to grasp them.\n\nLANDO CALRISSIAN, a man trying to make his way through an uncaring universe, is willing to bet all he has for a single score – and it begins with the deal of a lifetime....",
      "writers": [
        "Charles Soule"
      ]
    },
    {
      "type": "Comic",
      "id": "darth_vader_comic",
      "title": "Darth Vader",
      "release_date": "2015-02-11T19:02",
      "canon_date_sort": 0.6,
      "canon_date_begin": 0,
      "img_poster": "img/poster/darth_vader_comic_poster.jpg",
      "img_cover": "img/cover/darth_vader_comic_cover.jpg",
      "characters": [
        "darth_vader",
        "boba_fett"
      ],
      "synopsis_short": "Follow Vader straight from the ending of 'Star Wars: A New Hope' into his own series, showing the Empire's war with the Rebel Alliance from the other side.",
      "synopsis_long": "It is a period of insurgence. Rebel spaceships, striking from a hidden base on a moon of Yavin, have won a shocking surprise victory against the rightful reign of the Galactic Empire.\n\n The Empire's ultimate peacekeeping force, THE DEATH STAR, was destroyed due to an unforeseen design flaw. Without this deterrent, the rule of law is in danger. Chaos looms!\n\n For the nineteen years after the vanquishing of the Jedi and his painful rebirth on volcanic Mustafar, Sith Lord DARTH VADER has faithfully served his master. But now, he has failed the Emperor and must pay the price....",
      "writers": [
        "Kieron Gillen"
      ]
    },
    {
      "type": "Comic",
      "id": "star_wars_comic",
      "title": "Star Wars Comic",
      "release_date": "2015-01-14T19:02",
      "canon_date_sort": 0.5,
      "canon_date_begin": 0,
      "img_poster": "img/poster/star_wars_comic_poster.jpg",
      "img_cover": "img/cover/star_wars_comic_cover.jpg",
      "characters": [
        "luke_skywalker",
        "han_solo",
        "leia_organa",
        "darth_vader",
        "chewbacca",
        "r2_d2",
        "c_3po"
      ],
      "synopsis_short": "Luke Skywalker and the ragtag rebels opposing the Galactic Empire are fresh off their biggest victory so far — the destruction of the massive Death Star.",
      "synopsis_long": "Luke Skywalker and the ragtag rebels opposing the Galactic Empire are fresh off their biggest victory so far — the destruction of the massive Death Star. But the Empire’s not toppled yet! Join Luke, Princess Leia, Han Solo, Chewbacca, C-3PO, R2-D2 and the rest of the Rebel Alliance as they fight for freedom against Darth Vader and his evil master, the Emperor!\n\nBut when a Rebel assault goes wrong, Han and Leia must think fast to make their escape — while Luke comes face-to-face with Darth Vader! In the explosive aftermath, a humbled Luke returns to Tatooine to learn more about his mentor, Obi-Wan Kenobi. Meanwhile, Leia and Han undertake a vital — and dangerous — secret mission. But can they succeed without Luke?",
      "writers": [
        "Jason Aaron"
      ]
    },
    {
      "type": "Comic",
      "id": "chewbacca_comic",
      "title": "Chewbacca",
      "release_date": "2015-10-14T19:02",
      "canon_date_sort": 0.3,
      "canon_date_begin": 0,
      "img_poster": "img/poster/chewbacca_comic_poster.jpg",
      "img_cover": "img/cover/chewbacca_comic_cover.jpg",
      "characters": [
        "chewbacca"
      ],
      "synopsis_short": "Known as the skilled co-pilot of the infamous Millennium Falcon, the legendary Wookiee warrior Chewbacca will star in his very own limited comic series!",
      "synopsis_long": "Known as the skilled co-pilot of the infamous Millennium Falcon, the legendary Wookiee warrior CHEWBACCA will star in his very own limited comic series! After the battle of Yavin, Chewbacca is on his own when he crash lands his ship on an Imperial occupied planet. Now stranded, Chewie finds himself caught in the middle of trying to return to the rebellion and helping a young and feisty girl in need.",
      "writers": [
        "Gerry Duggan"
      ]
    },
    {
      "type": "Comic",
      "id": "c_3po_comic",
      "title": "C-3PO Comic",
      "release_date": "2015-12-01T19:02",
      "canon_date_sort": 4.5,
      "canon_date_begin": 4,
      "img_poster": "img/poster/c_3po_comic_poster.jpg",
      "img_cover": "img/cover/c_3po_comic_cover.jpg",
      "characters": [
        "c_3po"
      ],
      "synopsis_short": "The story of how C-3PO received a red-colored arm.",
      "synopsis_long": "The story of how C-3PO received a red-colored arm, as seen in the film Star Wars: Episode VII The Force Awakens.",
      "writers": [
        "James Robinson"
      ]
    },
    {
      "type": "Movie",
      "id": "han_solo_anthology",
      "title": "Anthology - Han Solo",
      "release_date": "2018-05-25T19:02",
      "canon_date_sort": -10,
      "canon_date_begin": -10,
      "img_poster": "img/poster/han_solo_anthology_poster.jpg",
      "img_cover": "img/cover/han_solo_anthology_cover.jpg",
      "characters": [
        "han_solo"
      ],
      "synopsis_short": "The plot is unknown.",
      "synopsis_long": "The plot is still unknown.",
      "director": "Phil Lord",
      "writers": [
        "Christopher Miller",
        "Lawrence Kasdan",
        "Jon Kasdan"
      ],
      "music_by": "John Williams"
    },
    {
      "type": "Movie",
      "id": "rogue_one",
      "title": "Rogue One",
      "release_date": "2016-12-16T19:02",
      "canon_date_sort": -1,
      "canon_date_begin": -1,
      "img_poster": "img/poster/rogue_one_poster.jpg",
      "img_cover": "img/cover/rogue_one_cover.jpg",
      "characters": [
        
      ],
      "synopsis_short": "Rebels set out on a mission to steal the plans for the Death Star.",
      "synopsis_long": "The film, which will begin production in the summer of 2015, is set between the films Star Wars: Episode III Revenge of the Sith and Star Wars: Episode IV A New Hope. The plot revolves around a band of resistance fighters uniting to steal the plans to the Death Star, the Galactic Empire's planet-destroying battle station. The theft of the Death Star plans was first referenced in the opening crawl in A New Hope.",
      "director": "Gareth Edwards",
      "writers": [
        "John Knoll",
        "Chris Weitz",
        "Gary Whitta"
      ],
      "music_by": "John Williams"
    },
    {
      "type": "Book",
      "id": "the_weapon_of_a_jedi",
      "title": "The Weapon of a Jedi",
      "release_date": "2015-09-04T19:02",
      "canon_date_sort": 0.45,
      "canon_date_begin": 0,
      "img_poster": "img/poster/the_weapon_of_a_jedi_poster.jpg",
      "img_cover": "img/cover/the_weapon_of_a_jedi_cover.jpg",
      "characters": [
        "luke_skywalker",
        "r2_d2",
        "c_3po",
        "sarco_plank"
      ],
      "synopsis_short": "Luke Skywalker returns for an all-new adventure in this thrilling upper middle grade novel.",
      "synopsis_long": "Luke Skywalker returns for an all-new adventure in this thrilling upper middle grade novel. Set between Star Wars: A New Hope and Star Wars: The Empire Strikes Back, the story finds Luke Skywalker, C-3PO, and R2-D2 stranded on a mysterious planet, and explores Luke's first-ever duel with a lightsaber.\n\nHidden in the story are also clues and hints about the upcoming film Star Wars: The Force Awakens, making this a must-read for fans old and new!",
      "author": "Jason Fry"
    },
    {
      "type": "Book",
      "id": "smugglers_run",
      "title": "Smuggler's Run",
      "release_date": "2015-09-04T19:02",
      "canon_date_sort": 0.2,
      "canon_date_begin": 0,
      "img_poster": "img/poster/smugglers_run_poster.jpg",
      "img_cover": "img/cover/smugglers_run_cover.jpg",
      "characters": [
        "han_solo",
        "chewbacca",
        "kallon_ematt"
      ],
      "synopsis_short": "Han Solo and Chewbacca the Wookiee team-up for an all-new adventure in this thrilling upper middle grade novel.",
      "synopsis_long": "Han Solo and Chewbacca the Wookiee team-up for an all-new adventure in this thrilling upper middle grade novel. Set between Star Wars: A New Hope and Star Wars: The Empire Strikes Back, the story follows everyone's favorite pair of smugglers as they fly the Millennium Falcon on a top-secret mission for the Rebellion.\n\nHidden in the story are also hints and clues about the upcoming film, Star Wars: The Force Awakens, making this a must-read for fans old and new!",
      "author": "Greg Rucka"
    },
    {
      "type": "Book",
      "id": "moving_target",
      "title": "Moving Target",
      "release_date": "2015-09-04T19:02",
      "canon_date_sort": 4.1,
      "canon_date_begin": 4,
      "img_poster": "img/poster/moving_target_poster.jpg",
      "img_cover": "img/cover/moving_target_cover.jpg",
      "characters": [
        "leia_organa",
        "nien_nunb",
        "c_3po",
        "kallon_ematt"
      ],
      "synopsis_short": "Princess Leia returns for an all-new adventure in this thrilling upper middle grade novel.",
      "synopsis_long": "Princess Leia returns for an all-new adventure in this thrilling upper middle grade novel. Set between Star Wars: The Empire Strikes Back and Star Wars: The Return of the Jedi, the story follows the warrior princess as she leads a ragtag group of rebels on a dangerous mission against the evil Galactic Empire.\n\n Hidden in the story are also hints and clues about the upcoming film Star Wars: The Force Awakens, making this a must-read for fans old and new!",
      "author": "Cecil Castellucci"
    },
    {
      "type": "Book",
      "id": "before_the_awakening",
      "title": "Before The Awakening",
      "release_date": "2015-12-18T19:02",
      "canon_date_sort": 34.8,
      "canon_date_begin": 34,
      "img_poster": "img/poster/before_the_awakening_poster.jpg",
      "img_cover": "img/cover/before_the_awakening_cover.jpg",
      "characters": [
        "rey",
        "finn",
        "poe_dameron",
        "bb_8"
      ],
      "synopsis_short": "An anthology book that focuses on the lives of Rey, Finn, and Poe before the events of the Star Wars: The Force Awakens.",
      "synopsis_long": "An anthology book that focuses on the lives of Rey, Finn, and Poe before the events of the Star Wars: The Force Awakens. A companion piece to the “Journey to Star Wars: The Force Awakens” character novels.",
      "author": "Greg Rucka"
    },
    {
      "type": "Book",
      "id": "aftermath_life_debt",
      "title": "Aftermath: Life Dept",
      "release_date": "2016-05-31T19:02",
      "canon_date_sort": 5,
      "canon_date_begin": 5,
      "img_poster": "img/poster/aftermath_life_debt_poster.jpg",
      "img_cover": "img/cover/space_cover.jpg",
      "characters": [
      ],
      "synopsis_short": "It is the second book in The Aftermath Trilogy.",
      "synopsis_long": "It is the second book in The Aftermath Trilogy. Written by Chuck Wendig.",
      "author": "Chuck Wendig"
    },
    {
      "type": "Book",
      "id": "new_republic_bloodline",
      "title": "New Republic: Bloodline",
      "release_date": "2016-03-29T19:02",
      "canon_date_sort": 28,
      "canon_date_begin": 28,
      "img_poster": "img/poster/new_republic_bloodline_poster.jpg",
      "img_cover": "img/cover/space_cover.jpg",
      "characters": [
      ],
      "synopsis_short": "From the New York Times bestselling author of Star Wars: Lost Stars comes a thrilling prequel to Star Wars: The Force Awakens.",
      "synopsis_long": "From the New York Times bestselling author of Star Wars: Lost Stars comes a thrilling prequel to Star Wars: The Force Awakens, set roughly six years before the events of the film.",
      "author": "Claudia Gray"
    },
    {
      "type": "Book",
      "id": "the_perfect_weapon",
      "title": "The Perfect Weapon",
      "release_date": "2015-11-24T19:02",
      "canon_date_sort": 30,
      "canon_date_begin": 30,
      "img_poster": "img/poster/the_perfect_weapon_poster.jpg",
      "img_cover": "img/cover/the_perfect_weapon_cover.jpg",
      "characters": [
        "bazine_netal"
      ],
      "synopsis_short": "An anonymous client has hired Bazine to track down an ex-stormtrooper and recover the mysterious package he’s safeguarding.",
      "synopsis_long": "An anonymous client has hired Bazine to track down an ex-stormtrooper and recover the mysterious package he’s safeguarding. Payment for the mission promises to be astronomical, but the obstacles facing Bazine will prove to be formidable.\n\nAnd though her eager new sidekick has cyber skills crucial to the mission, only Bazine’s razor-sharp talents will mean the difference between success or failure—and life or death.",
      "author": "Delilah S. Dawson"
    },
    {
      "type": "Comic",
      "id": "obi_wan_and_anakin",
      "title": "Obi-Wan and Anakin",
      "release_date": "2016-01-06T19:02",
      "canon_date_sort": -29,
      "canon_date_begin": -29,
      "img_poster": "img/poster/obi_wan_and_anakin_poster.jpg",
      "img_cover": "img/cover/obi_wan_and_anakin_cover.jpg",
      "characters": [
        "obi_wan_kenobi",
        "darth_vader"
      ],
      "synopsis_short": "It's been a few years since Obi-Wan pledged to train the young 'chosen one,' but even as they have grown closer through training, it has been a difficult road.",
      "synopsis_long": "It's been a few years since Obi-Wan pledged to train the young 'chosen one,' but even as they have grown closer through training, it has been a difficult road.\n\nNow, called to a remote planet for assistance, Master and Padawan may be pushed to the breaking point. The author bring us a tale of the Jedi at the height of their power.",
      "writers": [
        "Charles Soule"
      ]
    }
  ],
  "characters": [
    {
      "id": "luke_skywalker",
      "name": "Luke Skywalker",
      "img": "img/character/luke_skywalker.jpg",
      "media": [
        "a_new_hope",
        "heir_to_the_jedi",
        "the_weapon_of_a_jedi",
        "star_wars_comic",
        "the_empire_strikes_back",
        "return_of_the_jedi",
        "shattered_empire",
        "the_force_awakens"
      ]
    },
    {
      "id": "han_solo",
      "name": "Han Solo",
      "img": "img/character/han_solo.jpg",
      "media": [
        "a_new_hope",
        "smugglers_run",
        "star_wars_comic",
        "the_empire_strikes_back",
        "return_of_the_jedi",
        "shattered_empire",
        "the_force_awakens"
      ]
    },
    {
      "id": "leia_organa",
      "name": "Leia Organa",
      "title": "Princess",
      "img": "img/character/leia_organa.jpg",
      "media": [
        "a_new_hope",
        "princess_leia_comic",
        "star_wars_comic",
        "the_empire_strikes_back",
        "moving_target",
        "return_of_the_jedi",
        "shattered_empire",
        "the_force_awakens"
      ]
    },
    {
      "id": "chewbacca",
      "name": "Chewbacca",
      "img": "img/character/chewbacca.jpg",
      "media": [
        "revenge_of_the_sith",
        "a_new_hope",
        "smugglers_run",
        "star_wars_comic",
        "chewbacca_comic",
        "the_empire_strikes_back",
        "return_of_the_jedi",
        "shattered_empire",
        "the_force_awakens"
      ]
    },
    {
      "id": "darth_vader",
      "name": "Darth Vader",
      "img": "img/character/darth_vader.jpg",
      "media": [
        "the_phantom_menace",
        "obi_wan_and_anakin",
        "attack_of_the_clones",
        "the_clone_wars",
        "revenge_of_the_sith",
        "rebels",
        "lords_of_the_sith",
        "a_new_hope",
        "star_wars_comic",
        "darth_vader_comic",
        "the_empire_strikes_back",
        "return_of_the_jedi"
      ]
    },
    {
      "id": "c_3po",
      "name": "C-3PO",
      "img": "img/character/c_3po.jpg",
      "media": [
        "the_phantom_menace",
        "attack_of_the_clones",
        "revenge_of_the_sith",
        "a_new_hope",
        "the_weapon_of_a_jedi",
        "star_wars_comic",
        "the_empire_strikes_back",
        "moving_target",
        "return_of_the_jedi",
        "shattered_empire",
        "c_3po_comic",
        "the_force_awakens"
      ]
    },
    {
      "id": "r2_d2",
      "name": "R2-D2",
      "img": "img/character/r2_d2.jpg",
      "media": [
        "the_phantom_menace",
        "attack_of_the_clones",
        "revenge_of_the_sith",
        "a_new_hope",
        "princess_leia_comic",
        "heir_to_the_jedi",
        "the_weapon_of_a_jedi",
        "star_wars_comic",
        "the_empire_strikes_back",
        "return_of_the_jedi",
        "shattered_empire",
        "the_force_awakens"
      ]
    },
    {
      "id": "obi_wan_kenobi",
      "name": "Obi-Wan Kenobi",
      "img": "img/character/obi_wan_kenobi.jpg",
      "media": [
        "the_phantom_menace",
        "obi_wan_and_anakin",
        "attack_of_the_clones",
        "revenge_of_the_sith",
        "a_new_hope",
        "the_empire_strikes_back",
        "return_of_the_jedi"
      ]
    },
    {
      "id": "yoda",
      "name": "Yoda",
      "img": "img/character/yoda.jpg",
      "media": [
        "the_phantom_menace",
        "attack_of_the_clones",
        "the_clone_wars",
        "revenge_of_the_sith",
        "the_empire_strikes_back",
        "return_of_the_jedi"
      ]
    },
    {
      "id": "lando_calrissian",
      "name": "Lando Calrissian",
      "img": "img/character/lando_calrissian.jpg",
      "media": [
        "rebels",
        "lando_comic",
        "the_empire_strikes_back",
        "return_of_the_jedi"
      ]
    },
    {
      "id": "asajj_ventress",
      "name": "Asajj Ventress",
      "img": "img/character/asajj_ventress.jpg",
      "media": [
        "the_clone_wars",
        "dark_disciple"
      ]
    },
    {
      "id": "quinlan_vos",
      "name": "Quinlan Vos",
      "img": "img/character/quinlan_vos.jpg",
      "media": [
        "dark_disciple"
      ]
    },
    {
      "id": "rey",
      "name": "Rey",
      "img": "img/character/rey.jpg",
      "media": [
        "before_the_awakening",
        "the_force_awakens"
      ]
    },
    {
      "id": "finn",
      "name": "Finn",
      "img": "img/character/finn.jpg",
      "media": [
        "before_the_awakening",
        "the_force_awakens"
      ]
    },
    {
      "id": "kylo_ren",
      "name": "Kylo Ren",
      "img": "img/character/kylo_ren.jpg",
      "media": [
        "the_force_awakens"
      ]
    },
    {
      "id": "poe_dameron",
      "name": "Poe Dameron",
      "img": "img/character/poe_dameron.jpg",
      "media": [
        "before_the_awakening",
        "the_force_awakens"
      ]
    },
    {
      "id": "hux",
      "name": "Hux",
      "title": "General",
      "img": "img/character/hux.jpg",
      "media": [
        "the_force_awakens"
      ]
    },
    {
      "id": "phasma",
      "name": "Phasma",
      "title": "Captain",
      "img": "img/character/phasma.jpg",
      "media": [
        "the_force_awakens"
      ]
    },
    {
      "id": "snoke",
      "name": "Snoke",
      "title": "Supreme Leader",
      "img": "img/character/snoke.jpg",
      "media": [
        "the_force_awakens"
      ]
    },
    {
      "id": "ezra_bridger",
      "name": "Ezra Bridger",
      "img": "img/character/ezra_bridger.jpg",
      "media": [
        "rebels"
      ]
    },
    {
      "id": "kanan_jarrus",
      "name": "Kanan Jarrus",
      "img": "img/character/kanan_jarrus.jpg",
      "media": [
        "kanan_comic",
        "rebels",
        "a_new_dawn"
      ]
    },
    {
      "id": "hera_syndulla",
      "name": "Hera Syndulla",
      "img": "img/character/hera_syndulla.jpg",
      "media": [
        "rebels",
        "a_new_dawn"
      ]
    },
    {
      "id": "sabine_wren",
      "name": "Sabine Wren",
      "img": "img/character/sabine_wren.jpg",
      "media": [
        "rebels"
      ]
    },
    {
      "id": "garazeb_orrelios",
      "name": "Garazeb Orrelios",
      "img": "img/character/garazeb_orrelios.jpg",
      "media": [
        "rebels"
      ]
    },
    {
      "id": "qui_gon_jinn",
      "name": "Qui-Gon Jinn",
      "img": "img/character/qui_gon_jinn.jpg",
      "media": [
        "the_phantom_menace"
      ]
    },
    {
      "id": "kallus",
      "name": "Kallus",
      "title": "Agent",
      "img": "img/character/kallus.jpg",
      "media": [
        "rebels"
      ]
    },
    {
      "id": "padme_amidala",
      "name": "Padmé Amidala",
      "title": "Queen",
      "img": "img/character/padme_amidala.jpg",
      "media": [
        "the_phantom_menace",
        "attack_of_the_clones",
        "the_clone_wars",
        "revenge_of_the_sith"
      ]
    },
    {
      "id": "darth_maul",
      "name": "Darth Maul",
      "img": "img/character/darth_maul.jpg",
      "media": [
        "the_phantom_menace",
        "the_clone_wars",
        "son_of_dathomir"
      ]
    },
    {
      "id": "palpatine",
      "name": "Sheev Palpatine",
      "title": "Emperor",
      "img": "img/character/palpatine.jpg",
      "media": [
        "the_phantom_menace",
        "attack_of_the_clones",
        "the_clone_wars",
        "son_of_dathomir",
        "revenge_of_the_sith",
        "lords_of_the_sith",
        "rebels",
        "the_empire_strikes_back",
        "return_of_the_jedi"
      ]
    },
    {
      "id": "jar_jar_binks",
      "name": "Jar Jar Binks",
      "img": "img/character/jar_jar_binks.jpg",
      "media": [
        "the_phantom_menace",
        "attack_of_the_clones",
        "the_clone_wars",
        "revenge_of_the_sith"
      ]
    },
    {
      "id": "mace_windu",
      "name": "Mace Windu",
      "img": "img/character/mace_windu.jpg",
      "media": [
        "the_phantom_menace",
        "attack_of_the_clones",
        "the_clone_wars",
        "revenge_of_the_sith"
      ]
    },
    {
      "id": "count_dooku",
      "name": "Dooku",
      "title": "Count",
      "img": "img/character/count_dooku.jpg",
      "media": [
        "attack_of_the_clones",
        "the_clone_wars",
        "revenge_of_the_sith"
      ]
    },
    {
      "id": "jango_fett",
      "name": "Jango Fett",
      "img": "img/character/jango_fett.jpg",
      "media": [
        "attack_of_the_clones"
      ]
    },
    {
      "id": "boba_fett",
      "name": "Boba Fett",
      "img": "img/character/boba_fett.jpg",
      "media": [
        "attack_of_the_clones",
        "the_clone_wars",
        "dark_disciple",
        "star_wars_comic",
        "darth_vader_comic",
        "the_empire_strikes_back",
        "return_of_the_jedi"
      ]
    },
    {
      "id": "ahsoka_tano",
      "name": "Ahsoka Tano",
      "img": "img/character/ahsoka_tano.jpg",
      "media": [
        "the_clone_wars",
        "rebels"
      ]
    },
    {
      "id": "cham_syndulla",
      "name": "Cham Syndulla",
      "img": "img/character/cham_syndulla.jpg",
      "media": [
        "the_clone_wars",
        "lords_of_the_sith"
      ]
    },
    {
      "id": "tarkin",
      "name": "Wilhuff Tarkin",
      "title": "Grand Moff",
      "img": "img/character/tarkin.jpg",
      "media": [
        "lords_of_the_sith",
        "tarkin_book",
        "rebels",
        "a_new_hope"
      ]
    },
    {
      "id": "wedge_antilles",
      "name": "Wedge Antilles",
      "img": "img/character/wedge_antilles.jpg",
      "media": [
        "a_new_hope",
        "the_empire_strikes_back",
        "return_of_the_jedi",
        "aftermath"
      ]
    },
    {
      "id": "norra_wexley",
      "name": "Norra Wexley",
      "img": "img/character/unknown.jpg",
      "media": [
        "aftermath"
      ]
    },
    {
      "id": "ciena_ree",
      "name": "Ciena Ree",
      "img": "img/character/ciena_ree.jpg",
      "media": [
        "lost_stars"
      ]
    },
    {
      "id": "thane_kyrell",
      "name": "Thane Kyrell",
      "img": "img/character/thane_kyrell.jpg",
      "media": [
        "lost_stars"
      ]
    },
    {
      "id": "nakari_kelen",
      "name": "Nakari Kelen",
      "img": "img/character/nakari_kelen.jpg",
      "media": [
        "heir_to_the_jedi"
      ]
    },
    {
      "id": "ackbar",
      "name": "Ackbar",
      "title": "Admiral",
      "img": "img/character/ackbar.jpg",
      "media": [
        "moving_target",
        "return_of_the_jedi",
        "aftermath"
      ]
    },
    {
      "id": "grievous",
      "name": "Grievous",
      "title": "General",
      "img": "img/character/grievous.jpg",
      "media": [
        "revenge_of_the_sith",
        "the_clone_wars",
        "son_of_dathomir"
      ]
    },
    {
      "id": "depa_billaba",
      "name": "Depa Billaba",
      "img": "img/character/depa_billaba.jpg",
      "media": [
        "the_phantom_menace",
        "attack_of_the_clones",
        "kanan_comic"
      ]
    },
    {
      "id": "evaan_verlaine",
      "name": "Evaan Verlaine",
      "img": "img/character/evaan_verlaine.jpg",
      "media": [
        "princess_leia_comic"
      ]
    },
    {
      "id": "sana_solo",
      "name": "Sana Solo",
      "img": "img/character/sana_solo.jpg",
      "media": [
        "star_wars_comic"
      ]
    },
    {
      "id": "kes_dameron",
      "name": "Kes Dameron",
      "img": "img/character/kes_dameron.jpg",
      "media": [
        "shattered_empire"
      ]
    },
    {
      "id": "shara_bey",
      "name": "Shara Bey",
      "img": "img/character/shara_bey.jpg",
      "media": [
        "shattered_empire"
      ]
    },
    {
      "id": "lobot",
      "name": "Lobot",
      "img": "img/character/lobot.jpg",
      "media": [
        "the_empire_strikes_back",
        "lando_comic"
      ]
    },
    {
      "id": "rae_sloane",
      "name": "Rae Sloane",
      "img": "img/character/rae_sloane.jpg",
      "media": [
        "a_new_dawn",
        "aftermath"
      ]
    },
    {
      "id": "sarco_plank",
      "name": "Sarco Plank",
      "img": "img/character/sarco_plank.jpg",
      "media": [
        "the_weapon_of_a_jedi",
        "the_force_awakens"
      ]
    },
    {
      "id": "kallon_ematt",
      "name": "Kallon Ematt",
      "img": "img/character/kallon_ematt.jpg",
      "media": [
        "smugglers_run",
        "moving_target"
      ]
    },
    {
      "id": "nien_nunb",
      "name": "Nien Nunb",
      "img": "img/character/nien_nunb.jpg",
      "media": [
        "princess_leia_comic",
        "moving_target",
        "return_of_the_jedi"
      ]
    },
    {
      "id": "bb_8",
      "name": "BB-8",
      "img": "img/character/bb_8.jpg",
      "media": [
        "before_the_awakening",
        "the_force_awakens"
      ]
    },
    {
      "id": "bazine_netal",
      "name": "Bazine Netal",
      "img": "img/character/bazine_netal.jpg",
      "media": [
        "the_perfect_weapon",
        "the_force_awakens"
      ]
    }
  ]
}