{
  "media": [
    {
      "type": "Book",
      "id": "dark_disciple",
      "title": "Dark Disciple",
      "release_date": "2015-08-24T19:02",
      "canon_date_begin": -20,
      "canon_date_end": -19,
      "img_poster": "http://img3.wikia.nocookie.net/__cb20141209194455/starwars/images/thumb/9/90/Dark_Disciple_Cover.png/400px-Dark_Disciple_Cover.png",
      "img_cover": "http://a.dilcdn.com/bl/wp-content/uploads/sites/6/2015/07/ventress_header-2400x1200-996929412987.jpeg",
      "characters": [
        "asajj_ventress",
        "quinlan_vos"
      ],
      "synopsis_short": "The only way to bring down the dark side's most dangerous warrior may be for Jedi and Sith to join forces.",
      "synopsis_long": "The only way to bring down the dark side's most dangerous warrior may be for Jedi and Sith to join forces.\n\n In the war for control of the galaxy between the armies of the dark side and the Republic, former Jedi Master turned ruthless Sith Lord Count Dooku has grown ever more brutal in his tactics. Despite the powers of the Jedi and the military prowess of their clone army, the sheer number of fatalities is taking a terrible toll. And when Dooku orders the massacre of a flotilla of helpless refugees, the Jedi Council feels it has no choice but to take drastic action: targeting the man responsible for so many war atrocities, Count Dooku himself.\n\nBut the ever-elusive Dooku is dangerous prey for even the most skilled hunter. So the Council makes the bold decision to bring both sides of the Force's power to bear—pairing brash Jedi Knight Quinlan Vos with infamous one-time Sith acolyte Asajj Ventress. Though Jedi distrust for the cunning killer who once served at Dooku's side still runs deep, Ventress's hatred for her former master runs deeper. She's more than willing to lend her copious talents as a bounty hunter—and assassin—to Vos's quest.\n\nTogether, Ventress and Vos are the best hope for eliminating Dooku—as long as the emerging feelings between them don't compromise their mission. But Ventress is determined to have her retribution and at last let go of her dark Sith past. Balancing the complicated emotions she feels for Vos with the fury of her warrior's spirit, she resolves to claim victory on all fronts—a vow that will be mercilessly tested by her deadly enemy . . . and her own doubt.",
      "author": "Christie Golden",
      "director": null,
      "writers": null,
      "music_by": null
    },
    {
      "type": "Movie",
      "id": "the_empire_strikes_back",
      "title": "Episode V - The Empire Strikes Back",
      "release_date": "1980-05-21T19:02",
      "canon_date_begin": 3,
      "canon_date_end": null,
      "img_poster": "http://img4.wikia.nocookie.net/__cb20061201083417/starwars/images/thumb/e/e4/Empire_strikes_back_old.jpg/500px-Empire_strikes_back_old.jpg",
      "img_cover": "http://media.trb.com/media/photo/2012-05/70217380.jpg",
      "characters": [
        "luke_skywalker",
        "leia_organa",
        "han_solo",
        "darth_vader",
        "lando_calrissian",
        "r2_d2",
        "c_3po",
        "obi_wan_kenobi"
      ],
      "synopsis_short": "After the rebels have been brutally overpowered by the Empire on their newly established base, Luke Skywalker takes advanced Jedi training with Master Yoda, while his friends are pursued by Darth Vader as part of his plan to capture Luke.",
      "synopsis_long": "After the rebels have been brutally overpowered by the Empire on their newly established base, Luke Skywalker takes advanced Jedi training with Master Yoda, while his friends are pursued by Darth Vader as part of his plan to capture Luke.",
      "author": null,
      "director": "Irvin Kershner",
      "writers": [
        "George Lucas",
        "Lawrence Kasdan",
        "Leigh Brackett"
      ],
      "music_by": "John Williams"
    },
    {
      "type": "Movie",
      "id": "the_force_awakens",
      "title": "Episode VII - The Force Awakens",
      "release_date": "2015-12-18T19:02",
      "canon_date_begin": 34,
      "canon_date_end": null,
      "img_poster": "http://ia.media-imdb.com/images/M/MV5BNDE5NTMzMzk0OF5BMl5BanBnXkFtZTgwNzcyMTk1NjE@._V1__SX1217_SY847_.jpg",
      "img_cover": "http://www.themarysue.com/wp-content/uploads/2015/02/o-FORCE-AWAKENS-GIFS-facebook.jpg",
      "characters": [
        "rey",
        "finn",
        "kylo_ren",
        "poe_dameron",
        "hux",
        "phasma",
        "snoke",
        "han_solo",
        "luke_skywalker",
        "leia_organa",
        "chewbacca",
        "r2_d2",
        "c_3po"
      ],
      "synopsis_short": "A continuation of the saga created by George Lucas set thirty years after Star Wars: Episode VI - Return of the Jedi",
      "synopsis_long": "A continuation of the saga created by George Lucas set thirty years after Star Wars: Episode VI - Return of the Jedi",
      "author": null,
      "director": "J.J. Abrams",
      "writers": [
        "J.J. Abrams",
        "Lawrence Kasdan"
      ],
      "music_by": "John Williams"
    },
    {
      "type": "Comic",
      "id": "shattered_empire",
      "title": "Shattered Empire",
      "release_date": "2015-09-09T19:02",
      "canon_date_begin": 4,
      "canon_date_end": null,
      "img_poster": "http://img1.wikia.nocookie.net/__cb20150823103548/starwars/images/b/bc/SWShatteredEmpire1Mayhew.png",
      "img_cover": "http://img2.wikia.nocookie.net/__cb20150828043502/starwars/images/1/13/Shattered_Empire_1_textless_cover.jpg",
      "characters": [
        "luke_skywalker",
        "leia_organa",
        "han_solo",
        "obi_wan_kenobi",
        "darth_vader",
        "r2_d2",
        "lando_calrissian",
        "c_3po"
      ],
      "synopsis_short": "The heroes of the Rebel Alliance will soon discover that a wounded and fractious Empire may be more dangerous than any threat they faced before!",
      "synopsis_long": "Emperor Palpatine's twenty-year reign of terror came to an abrupt and fiery end in the skies above the forest moon of Endor. A decisive victory for the Rebel Alliance, to be sure, but even with the loss of its leadership, the Empire's Moffs and regional governors retained their hold on important systems from the Core to the Outer Rim, thanks to the might of the Imperial Starfleet. Now, with a power vacuum atop the Empire, those Moffs will jockey for position and control, and the heroes of the Rebel Alliance will soon discover that a wounded and fractious Empire may be more dangerous than any threat they faced before!",
      "author": null,
      "director": null,
      "writers": [
        "Greg Rucka"
      ],
      "music_by": null
    },
    {
      "type": "TV",
      "id": "rebels",
      "title": "Rebels",
      "release_date": "2014-09-26T19:02",
      "canon_date_begin": -5,
      "canon_date_end": -2,
      "img_poster": "http://i1.wp.com/www.slashfilm.com/wp/wp-content/images/Star-Wars-Rebels-Season-2-Poster.jpeg",
      "img_cover": "http://cdn2-www.craveonline.com/assets/uploads/2014/10/Star-Wars-Rebels-Action.jpg",
      "characters": [
        "ezra_bridger",
        "kanan_jarrus",
        "hera_syndulla",
        "sabine_wren",
        "garazeb_orrelios",
        "kallus"
      ],
      "synopsis_short": "A brave and clever ragtag starship crew stands up against the evil Empire as it tightens its grip on the galaxy and hunts down the last of the Jedi Knights.",
      "synopsis_long": "The series follows a motley group of rebels who live aboard the starship Ghost as they fight against the evil Galactic Empire. The rebels include Ezra Bridger, a young orphan from Lothal who learns he can use the Force; Kanan Jarrus, a Jedi who survived Order 66; Hera Syndulla, a Twi'lek pilot and veteran resistance fighter; Sabine Wren, a Mandalorian explosives expert; Garazeb 'Zeb' Orrelios, a Lasat warrior; and the cantankerous astromech droid C1-10P, also known as Chopper. The crew will eventually help give rise to the Rebel Alliance.",
      "author": null,
      "director": null,
      "writers": null,
      "creators": [
        "Simon Kinberg",
        "Carrie Beck",
        "Dave Filoni"
      ],
      "music_by": null
    },
    {
      "type": "Movie",
      "id": "the_phantom_menace",
      "title": "Episode I - The Phantom Menace",
      "release_date": "1999-05-19T19:02",
      "canon_date_begin": -32,
      "canon_date_end": null,
      "img_poster": "http://img1.wikia.nocookie.net/__cb20130822171446/starwars/images/thumb/7/75/EPI_TPM_poster.png/500px-EPI_TPM_poster.png",
      "img_cover": "http://ibytes.es/images/content/postimages/YosoytuPadreTA/ST9x-L.jpg",
      "characters": [
        "qui_gon_jinn",
        "obi_wan_kenobi",
        "padme_amidala",
        "darth_maul",
        "r2_d2",
        "yoda",
        "c_3po",
        "darth_vader"
      ],
      "synopsis_short": "Two Jedi Knights escape a hostile blockade to find allies and come across a young boy who may bring balance to the Force, but the long dormant Sith resurface to reclaim their old glory.",
      "synopsis_long": "The evil Trade Federation, led by Nute Gunray is planning to take over the peaceful world of Naboo. Jedi Knights Qui-Gon Jinn and Obi-Wan Kenobi are sent to confront the leaders. But not everything goes to plan. The two Jedi escape, and along with their new Gungan friend, Jar Jar Binks head to Naboo to warn Queen Amidala, but droids have already started to capture Naboo and the Queen is not safe there. \n\nEventually, they land on Tatooine, where they become friends with a young boy known as Anakin Skywalker. Qui-Gon is curious about the boy, and sees a bright future for him. The group must now find a way of getting to Coruscant and to finally solve this trade dispute, but there is someone else hiding in the shadows. Are the Sith really extinct? Is the Queen really who she says she is? And what's so special about this young boy?",
      "author": null,
      "director": "George Lucas",
      "writers": [
        "George Lucas"
      ],
      "music_by": "John Williams"
    },
    {
      "type": "Movie",
      "id": "attack_of_the_clones",
      "title": "Episode II - Attack of the Clones",
      "release_date": "2002-05-16T19:02",
      "canon_date_begin": -22,
      "canon_date_end": null,
      "img_poster": "http://img11.deviantart.net/502d/i/2014/244/4/c/star_wars_episode_ii__attack_of_the_clones_by_ihaveanawesomename-d7ximjf.jpg",
      "img_cover": "https://i.kinja-img.com/gawker-media/image/upload/18dy2l4yafs7pjpg.jpg",
      "characters": [
        "obi_wan_kenobi",
        "darth_vader",
        "padme_amidala",
        "count_dooku",
        "jango_fett",
        "yoda"
      ],
      "synopsis_short": "Ten years after initially meeting, Anakin Skywalker shares a forbidden romance with Padmé, while Obi-Wan investigates an assassination attempt on the Senator and discovers a secret clone army crafted for the Jedi.",
      "synopsis_long": "Ten years after the 'Phantom Menace' threatened the planet Naboo, Padmé Amidala is now a Senator representing her homeworld. A faction of political separatists, led by Count Dooku, attempts to assassinate her. \n\nThere are not enough Jedi to defend the Republic against the threat, so Chancellor Palpatine enlists the aid of Jango Fett, who promises that his army of clones will handle the situation. Meanwhile, Obi-Wan Kenobi continues to train the young Jedi Anakin Skywalker, who fears that the Jedi code will forbid his growing romance with Amidala.",
      "author": null,
      "director": "George Lucas",
      "writers": [
        "George Lucas",
        "Jonathan Hales"
      ],
      "music_by": "John Williams"
    },
    {
      "type": "TV",
      "id": "the_clone_wars",
      "title": "The Clone Wars",
      "release_date": "2008-08-15T19:02",
      "canon_date_begin": -22,
      "canon_date_end": -20,
      "img_poster": "http://img05.deviantart.net/c72e/i/2012/159/b/5/clone_wars_4_poster_by_denisogloblin-d52peeo.jpg",
      "img_cover": "http://www.mattgaser.com/wp-content/uploads/2014/01/StarWars-630x316.jpg",
      "characters": [
        "ahsoka_tano",
        "obi_wan_kenobi",
        "darth_vader",
        "count_dooku",
        "mace_windu",
        "yoda"
      ],
      "synopsis_short": "The Grand Army of the Republic, led by Yoda, Mace Windu, Obi-Wan Kenobi, Anakin Skywalker and other Jedi Knights, fights the New Droid Army of the Separatists.",
      "synopsis_long": "As the Clone Wars sweep through the galaxy, the heroic Jedi Knights struggle to maintain order and restore peace. More and more systems are falling prey to the forces of the dark side as the Galactic Republic slips further and further under the sway of the Separatists and their never-ending droid army.",
      "author": null,
      "director": null,
      "writers": null,
      "creators": [
        "George Lucas"
      ],
      "music_by": null
    },
    {
      "type": "Book",
      "id": "a_new_dawn",
      "title": "A New Dawn",
      "release_date": "2014-09-02T19:02",
      "canon_date_begin": -11,
      "canon_date_end": null,
      "img_poster": "https://m2.behance.net/rendition/pm/27815551/max_1200/b5825157f9518e31eab2aef2a79d5aa9.jpg",
      "img_cover": "http://oyster.ignimgs.com/wordpress/stg.ign.com/2014/08/starwars_082514_1600.jpg",
      "characters": [
        "kanan_jarrus",
        "hera_syndulla"
      ],
      "synopsis_short": "The brutal death of a friend at the Empire's hands forces an ex-Jedi to make a choice: bow down to fear, or stand up and fight.",
      "synopsis_long": "Ever since the Jedi were marked for death and forced to flee Coruscant, Kanan Jarrus has devoted himself to staying alive rather than serving the Force. Wandering the galaxy alone, from one anonymous job to another, he avoids trouble--especially with the Empire--at all costs. So when he discovers a deadly conflict brewing between ruthless Imperial forces and desperate revolutionaries, he's not about to get caught in the crossfire. Then the brutal death of a friend at the Empire's hands forces the ex-Jedi to make a choice: bow down to fear, or stand up and fight. \n\nBut Jarrus won't be fighting alone. Unlikely allies, including a bomb-throwing radical, a former Imperial surveillance agent, a vengeful security officer, and the mysterious Hera Syndulla--an agent provocateur with motives of her own--team up with Jarrus to challenge the Empire. As a crisis of apocalyptic proportions unfolds on the planet Gorse, they must stand together against one of the Emperor's most fearsome enforcers--for the sake of a world and its people",
      "author": "John Jackson Miller",
      "director": null,
      "writers": null,
      "music_by": null
    },
    {
      "type": "Book",
      "id": "lords_of_the_sith",
      "title": "Lords of the Sith",
      "release_date": "2015-04-28T19:02",
      "canon_date_begin": -14,
      "canon_date_end": null,
      "img_poster": "http://img2.wikia.nocookie.net/__cb20140425200446/starwars/images/thumb/6/6b/Lords_of_the_Sith.jpg/400px-Lords_of_the_Sith.jpg",
      "img_cover": "http://img1.wikia.nocookie.net/__cb20121005170757/starwars/images/3/35/Syndulla_charge.png",
      "characters": [
        "darth_vader",
        "palpatine",
        "cham_syndulla"
      ],
      "synopsis_short": "When the Emperor and his notorious apprentice, Darth Vader, find themselves stranded in the middle of insurgent action on an inhospitable planet, they must rely on each other, the Force, and their own ruthlessness to prevail.",
      "synopsis_long": "Anakin Skywalker, Jedi Knight, is just a memory. Darth Vader, newly anointed Sith Lord, is ascendant. The Emperor’s chosen apprentice has swiftly proven his loyalty to the dark side. Still, the history of the Sith Order is one of duplicity, betrayal, and acolytes violently usurping their Masters—and the truest measure of Vader’s allegiance has yet to be taken. Until now.\n\nOn Ryloth, a planet crucial to the growing Empire as a source of slave labor and the narcotic known as “spice,” an aggressive resistance movement has arisen, led by Cham Syndulla, an idealistic freedom fighter, and Isval, a vengeful former slave. But Emperor Palpatine means to control the embattled world and its precious resources—by political power or firepower—and he will be neither intimidated nor denied. Accompanied by his merciless disciple, Darth Vader, he sets out on a rare personal mission to ensure his will is done.",
      "author": "Paul S. Kemp",
      "director": null,
      "writers": null,
      "music_by": null
    },
    {
      "type": "Book",
      "id": "tarkin",
      "title": "Tarkin",
      "release_date": "2014-11-04T19:02",
      "canon_date_begin": -14,
      "canon_date_end": null,
      "img_poster": "http://img1.wikia.nocookie.net/__cb20140425191637/starwars/images/thumb/d/df/TarkinCover.jpg/500px-TarkinCover.jpg",
      "img_cover": "http://40.media.tumblr.com/476b06e844e5ad997815b6b5482020ad/tumblr_inline_nlh4r7AER41t92xkt_1280.jpg",
      "characters": [
        "tarkin",
        "darth_vader",
        "palpatine"
      ],
      "synopsis_short": "Governor Wilhuff Tarkin rises through the Imperial ranks, enforcing his authority ever more mercilessly . . . and zealously pursuing his destiny as the architect of absolute dominion.",
      "synopsis_long": "He’s the scion of an honorable and revered family. A dedicated soldier and distinguished legislator. Loyal proponent of the Republic and trusted ally of the Jedi Order. Groomed by the ruthless politician and Sith Lord who would be Emperor, Governor Wilhuff Tarkin rises through the Imperial ranks, enforcing his authority ever more mercilessly . . . and zealously pursuing his destiny as the architect of absolute dominion. \n\nEscalating guerrilla attacks by resistance forces and newfound evidence of a growing Separatist conspiracy are an immediate danger the Empire must meet with swift and brutal action. And to bring down a band of elusive freedom fighters, the Emperor turns to his most formidable agents: Darth Vader, the fearsome new Sith enforcer as remorseless as he is mysterious; and Tarkin—whose tactical cunning and cold-blooded efficiency will pave the way for the Empire’s supremacy . . . and its enemies’ extinction.",
      "author": "James Luceno",
      "director": null,
      "writers": null,
      "music_by": null
    },
    {
      "type": "Book",
      "id": "aftermath",
      "title": "Aftermath",
      "release_date": "2015-09-04T19:02",
      "canon_date_begin": 5,
      "canon_date_end": null,
      "img_poster": "http://img4.wikia.nocookie.net/__cb20150317200932/starwars/images/thumb/7/7f/Aftermath-Cover.png/400px-Aftermath-Cover.png",
      "img_cover": "http://cdn.desktopwallpapers4.me/wallpapers/movies/1920x1080/3/29143-star-wars-imperial-star-destroyer-1920x1080-movie-wallpaper.jpg",
      "characters": [
        "wedge_antilles",
        "norra_wexley"
      ],
      "synopsis_short": "The second Death Star is destroyed. The Emperor and his powerful enforcer, Darth Vader, are rumored to be dead. The Galactic Empire is in chaos.",
      "synopsis_long": "As the Empire reels from its critical defeats at the Battle of Endor, the Rebel Alliance—now a fledgling New Republic—presses its advantage by hunting down the enemy's scattered forces before they can regroup and retaliate. But above the remote planet Akiva, an ominous show of the enemy's strength is unfolding. Out on a lone reconnaissance mission, pilot Wedge Antilles watches Imperial Star Destroyers gather like birds of prey circling for a kill, but is taken captive before he can report back to the New Republic leaders.\n\nMeanwhile, on the planet's surface, former Rebel fighter Norra Wexley has returned to her native world—war weary, ready to reunite with her estranged son, and eager to build a new life in some distant place. But when Norra intercepts Wedge Antilles's urgent distress call, she realizes her time as a freedom fighter is not yet over. What she doesn't know is just how close the enemy is—or how decisive and dangerous her new mission will be.",
      "author": "Chuck Wendig",
      "director": null,
      "writers": null,
      "music_by": null
    },
    {
      "type": "Book",
      "id": "heir_to_the_jedi",
      "title": "Heir to the Jedi",
      "release_date": "2015-03-03T19:02",
      "canon_date_begin": 1,
      "canon_date_end": null,
      "img_poster": "http://img2.wikia.nocookie.net/__cb20140425200555/starwars/images/thumb/c/c2/Heir_to_the_Jedi.jpg/400px-Heir_to_the_Jedi.jpg",
      "img_cover": "http://1.bp.blogspot.com/-VmC-P-yDIIM/VPMXMZZ4R5I/AAAAAAAA_-Q/lDDYaSBuELw/s1600/luke.jpg",
      "characters": [
        "luke_skywalker",
        "nakari_kelen",
        "r2_d2",
        "leia_organa",
        "ackbar"
      ],
      "synopsis_short": "He defeated the Empire's ultimate weapon and gave the Rebel Alliance new hope. But Luke Skywalker's battles—and the galaxy's fight for freedom—have only just begun.",
      "synopsis_long": "Luke Skywalker’s game-changing destruction of the Death Star has made him not only a hero of the Rebel Alliance but a valuable asset in the ongoing battle against the Empire. Though he’s a long way from mastering the power of the Force, there’s no denying his phenomenal skills as a pilot—and in the eyes of Rebel leaders Princess Leia Organa and Admiral Ackbar, there’s no one better qualified to carry out a daring rescue mission crucial to the Alliance cause.\n\nA brilliant alien cryptographer renowned for her ability to breach even the most advanced communications systems is being detained by Imperial agents determined to exploit her exceptional talents for the Empire’s purposes. But the prospective spy’s sympathies lie with the Rebels, and she’s willing to join their effort in exchange for being reunited with her family.\n\n It’s an opportunity to gain a critical edge against the Empire that’s too precious to pass up. It’s also a job that demands the element of surprise. So Luke and the ever-resourceful droid R2-D2 swap their trusty X-wing fighter for a sleek space yacht piloted by brash recruit Nakari Kelen, daughter of a biotech mogul, who’s got a score of her own to settle with the Empire.",
      "author": "Kevin Hearne",
      "director": null,
      "writers": null,
      "music_by": null
    }

  ],
  "characters": [
    {
      "id": "luke_skywalker",
      "name": "Luke Skywalker",
      "img": "http://img3.wikia.nocookie.net/__cb20091030151422/starwars/images/d/d9/Luke-rotjpromo.jpg",
      "media": [
        "a_new_hope",
        "heir_to_the_jedi",
        "the_empire_strikes_back",
        "return_of_the_jedi",
        "the_force_awakens"
      ]
    },
    {
      "id": "han_solo",
      "name": "Han Solo",
      "img": "http://img1.wikia.nocookie.net/__cb20100129155042/starwars/images/0/01/Hansoloprofile.jpg",
      "media": [
        "a_new_hope",
        "the_empire_strikes_back",
        "return_of_the_jedi",
        "the_force_awakens"
      ]
    },
    {
      "id": "leia_organa",
      "name": "Leia Organa",
      "title": "Princess",
      "img": "http://img2.wikia.nocookie.net/__cb20080506155343/starwars/images/thumb/8/89/Leia_endorpromo02.jpg/650px-Leia_endorpromo02.jpg",
      "media": [
        "a_new_hope",
        "heir_to_the_jedi",
        "the_empire_strikes_back",
        "moving_target",
        "return_of_the_jedi",
        "the_force_awakens"
      ]
    },
    {
      "id": "chewbacca",
      "name": "Chewbacca",
      "img": "http://img3.wikia.nocookie.net/__cb20141102165812/starwars/images/3/30/Chewbacca-DisneyWebsite.png",
      "media": [
        "revenge_of_the_sith",
        "a_new_hope",
        "the_empire_strikes_back",
        "return_of_the_jedi",
        "the_force_awakens"
      ]
    },
    {
      "id": "darth_vader",
      "name": "Darth Vader",
      "img": "http://cdn.bgr.com/2015/08/darth-vader.jpg",
      "media": [
        "the_phantom_menace",
        "attack_of_the_clones",
        "the_clone_wars",
        "revenge_of_the_sith",
        "rebels",
        "lords_of_the_sith",
        "a_new_hope",
        "the_empire_strikes_back",
        "return_of_the_jedi"
      ]
    },
    {
      "id": "c_3po",
      "name": "C-3PO",
      "img": "http://img2.wikia.nocookie.net/__cb20131005124036/starwars/images/thumb/5/51/C-3PO_EP3.png/400px-C-3PO_EP3.png",
      "media": [
        "the_phantom_menace",
        "attack_of_the_clones",
        "revenge_of_the_sith",
        "a_new_hope",
        "the_empire_strikes_back",
        "return_of_the_jedi",
        "the_force_awakens"
      ]
    },
    {
      "id": "r2_d2",
      "name": "R2-D2",
      "img": "http://img3.wikia.nocookie.net/__cb20150530203224/starwars/images/c/c0/R2D2SWE.png",
      "media": [
        "the_phantom_menace",
        "attack_of_the_clones",
        "revenge_of_the_sith",
        "a_new_hope",
        "heir_to_the_jedi",
        "the_empire_strikes_back",
        "return_of_the_jedi",
        "the_force_awakens"
      ]
    },
    {
      "id": "obi_wan_kenobi",
      "name": "Obi-Wan Kenobi",
      "img": "http://img3.wikia.nocookie.net/__cb20111115052816/starwars/images/4/4e/ObiWanHS-SWE.jpg",
      "media": [
        "the_phantom_menace",
        "attack_of_the_clones",
        "revenge_of_the_sith",
        "a_new_hope",
        "the_empire_strikes_back",
        "return_of_the_jedi"
      ]
    },
    {
      "id": "yoda",
      "name": "Yoda",
      "img": "http://img2.wikia.nocookie.net/__cb20150206140125/starwars/images/thumb/d/d6/Yoda_SWSB.png/650px-Yoda_SWSB.png",
      "media": [
        "the_phantom_menace",
        "attack_of_the_clones",
        "the_clone_wars",
        "revenge_of_the_sith",
        "a_new_hope",
        "the_empire_strikes_back",
        "return_of_the_jedi"
      ]
    },
    {
      "id": "lando_calrissian",
      "name": "Lando Calrissian",
      "img": "http://img1.wikia.nocookie.net/__cb20080715214753/starwars/images/7/7d/Lando_WoSW.jpg",
      "media": [
        "rebels",
        "the_empire_strikes_back",
        "return_of_the_jedi",
        "shattered_empire",
        "lando_comic"
      ]
    },
    {
      "id": "asajj_ventress",
      "name": "Asajj Ventress",
      "img": "http://img1.wikia.nocookie.net/__cb20150724125609/starwars/images/c/c7/Asajj_Ventress_Kindred_Spirits.png",
      "media": [
        "dark_disciple"
      ]
    },
    {
      "id": "quinlan_vos",
      "name": "Quinlan Vos",
      "img": "http://img4.wikia.nocookie.net/__cb20150727050605/starwars/images/thumb/f/f9/QuinlanHS.jpg/400px-QuinlanHS.jpg",
      "media": [
        "dark_disciple"
      ]
    },
    {
      "id": "rey",
      "name": "Rey",
      "img": "http://screenrant.com/wp-content/uploads/Daisy-Ridley-as-Rey-in-The-Force-Awakens.jpg",
      "media": [
        "the_force_awakens"
      ]
    },
    {
      "id": "finn",
      "name": "Finn",
      "img": "http://cdn.movieweb.com/img.news.tops/NEzGozCTqIMCDG_2_b.jpg",
      "media": [
        "the_force_awakens"
      ]
    },
    {
      "id": "kylo_ren",
      "name": "Kylo Ren",
      "img": "http://img1.wikia.nocookie.net/__cb20150517175543/starwars/images/c/c4/Kylo_Ren_art.jpg",
      "media": [
        "the_force_awakens"
      ]
    },
    {
      "id": "poe_dameron",
      "name": "Poe Dameron",
      "img": "http://cdn.fansided.com/wp-content/blogs.dir/319/files/2015/04/oscar-isaac-as-poe-dameron-850x560.jpg",
      "media": [
        "the_force_awakens"
      ]
    },
    {
      "id": "hux",
      "name": "Hux",
      "title": "General",
      "img": "http://www.telegraph.co.uk/content/dam/film/starwarsforceawakens/forceawakens24-xlarge.jpg",
      "media": [
        "the_force_awakens"
      ]
    },
    {
      "id": "phasma",
      "name": "Phasma",
      "title": "Captain",
      "img": "http://i.ytimg.com/vi/20YJOkpr1G4/maxresdefault.jpg",
      "media": [
        "the_force_awakens"
      ]
    },
    {
      "id": "snoke",
      "name": "Snoke",
      "title": "Supreme Leader",
      "img": "http://cdn.movieweb.com/img.news.tops/NEBbiXCO5gRKFD_2_b.jpg",
      "media": [
        "the_force_awakens"
      ]
    },
    {
      "id": "ezra_bridger",
      "name": "Ezra Bridger",
      "img": "http://img1.wikia.nocookie.net/__cb20140803194942/starwars/images/3/35/EzraBridger.png",
      "media": [
        "rebels"
      ]
    },
    {
      "id": "kanan_jarrus",
      "name": "Kanan Jarrus",
      "img": "http://img2.wikia.nocookie.net/__cb20140215113118/starwars/images/a/a7/KananJarrus.png",
      "media": [
        "rebels",
        "a_new_dawn"
      ]
    },
    {
      "id": "hera_syndulla",
      "name": "Hera Syndulla",
      "img": "http://img2.wikia.nocookie.net/__cb20140221185058/starwars/images/8/86/HeraSyndulla.png",
      "media": [
        "rebels",
        "a_new_dawn"
      ]
    },
    {
      "id": "sabine_wren",
      "name": "Sabine Wren",
      "img": "http://img3.wikia.nocookie.net/__cb20140220140838/starwars/images/5/51/SabineWren.png",
      "media": [
        "rebels"
      ]
    },
    {
      "id": "garazeb_orrelios",
      "name": "Garazeb Orrelios",
      "img": "http://img2.wikia.nocookie.net/__cb20141103040015/starwars/images/6/6a/ZebOrrelios.png",
      "media": [
        "rebels"
      ]
    },
    {
      "id": "qui_gon_jinn",
      "name": "Qui-Gon Jinn",
      "img": "http://img2.wikia.nocookie.net/__cb20100309144123/starwars/images/c/c0/Quigonheadshot.jpg",
      "media": [
        "the_phantom_menace"
      ]
    },
    {
      "id": "kallus",
      "name": "Kallus",
      "title": "Agent",
      "img": "http://img3.wikia.nocookie.net/__cb20150415045255/starwars/images/8/87/AgentKallus-SoR.png",
      "media": [
        "rebels"
      ]
    },
    {
      "id": "padme_amidala",
      "name": "Padmé Amidala",
      "title": "Queen",
      "img": "https://s-media-cache-ak0.pinimg.com/originals/99/26/6c/99266c287187c6eb164551b1d59e0680.jpg",
      "media": [
        "the_phantom_menace",
        "attack_of_the_clones",
        "the_clone_wars",
        "revenge_of_the_sith"
      ]
    },
    {
      "id": "darth_maul",
      "name": "Darth Maul",
      "img": "http://img2.wikia.nocookie.net/__cb20140209162228/starwars/images/thumb/5/50/Darth_Maul_profile.png/400px-Darth_Maul_profile.png",
      "media": [
        "the_phantom_menace",
        "the_clone_wars"
      ]
    },
    {
      "id": "palpatine",
      "name": "Sheev Palpatine",
      "title": "Emperor",
      "img": "http://img1.wikia.nocookie.net/__cb20130620100935/starwars/images/thumb/d/d8/Emperor_Sidious.png/400px-Emperor_Sidious.png",
      "media": [
        "the_phantom_menace",
        "attack_of_the_clones",
        "the_clone_wars",
        "revenge_of_the_sith",
        "lords_of_the_sith",
        "rebels",
        "the_empire_strikes_back",
        "return_of_the_jedi"
      ]
    },
    {
      "id": "jar_jar_binks",
      "name": "Jar Jar Binks",
      "img": "http://img1.wikia.nocookie.net/__cb20111208042120/starwars/images/4/42/JarJarHS-SWE.jpg",
      "media": [
        "the_phantom_menace",
        "attack_of_the_clones",
        "the_clone_wars",
        "revenge_of_the_sith"
      ]
    },
    {
      "id": "mace_windu",
      "name": "Mace Windu",
      "img": "http://img1.wikia.nocookie.net/__cb20071230055326/starwars/images/thumb/f/fc/Mace_Windu.jpg/400px-Mace_Windu.jpg",
      "media": [
        "the_phantom_menace",
        "attack_of_the_clones",
        "the_clone_wars",
        "revenge_of_the_sith"
      ]
    },
    {
      "id": "count_dooku",
      "name": "Dooku",
      "title": "Count",
      "img": "http://img4.wikia.nocookie.net/__cb20071218042012/starwars/images/f/f1/Count_Dooku_headshot_gaze.jpg",
      "media": [
        "attack_of_the_clones",
        "the_clone_wars",
        "revenge_of_the_sith"
      ]
    },
    {
      "id": "jango_fett",
      "name": "Jango Fett",
      "img": "http://img1.wikia.nocookie.net/__cb20111010213136/starwars/images/thumb/8/8f/JangoSansHelmet-SWE.jpg/400px-JangoSansHelmet-SWE.jpg",
      "media": [
        "attack_of_the_clones"
      ]
    },
    {
      "id": "ahsoka_tano",
      "name": "Ahsoka Tano",
      "img": "http://img4.wikia.nocookie.net/__cb20150313020047/starwars/images/5/5b/Ahsoka_Tano_Rebels_Profile.png",
      "media": [
        "the_clone_wars",
        "rebels"
      ]
    },
    {
      "id": "cham_syndulla",
      "name": "Cham Syndulla",
      "img": "http://img2.wikia.nocookie.net/__cb20090807213818/es.starwars/images/6/63/Cham_closeup.jpg",
      "media": [
        "the_clone_wars",
        "lords_of_the_sith"
      ]
    },
    {
      "id": "tarkin",
      "name": "Wilhuff Tarkin",
      "title": "Grand Moff",
      "img": "http://img1.wikia.nocookie.net/__cb20100620213033/starwars/images/thumb/c/c1/Tarkininfobox.jpg/400px-Tarkininfobox.jpg",
      "media": [
        "lords_of_the_sith",
        "rebels",
        "a_new_hope"
      ]
    },
    {
      "id": "wedge_antilles",
      "name": "Wedge Antilles",
      "img": "http://img3.wikia.nocookie.net/__cb20111008205416/starwars/images/5/51/Wedge_Antilles.jpg",
      "media": [
        "a_new_hope",
        "princess_leia_comic",
        "the_weapon_of_a_jedi",
        "the_empire_strikes_back",
        "return_of_the_jedi",
        "aftermath"
      ]
    },
    {
      "id": "norra_wexley",
      "name": "Norra Wexley",
      "img": "http://www.empireonline.com/images/uploaded/star-wars-question-mark.gif",
      "media": [
        "aftermath"
      ]
    },
    {
      "id": "nakari_kelen",
      "name": "Nakari Kelen",
      "img": "http://img3.wikia.nocookie.net/__cb20150310221343/starwars/images/6/64/Nakari_Kelen.png",
      "media": [
        "heir_to_the_jedi"
      ]
    },
    {
      "id": "ackbar",
      "name": "Ackbar",
      "title": "Admiral",
      "img": "http://img1.wikia.nocookie.net/__cb20081118162020/starwars/images/f/fb/Ackbar_HS.jpg",
      "media": [
        "princess_leia_comic",
        "heir_to_the_jedi",
        "moving_target",
        "return_of_the_jedi",
        "aftermath"
      ]
    }

  ]
}